# ——————————————————————————女神保佑，代码无bug——————————————————————
#         ´´´´´´´´██´´´´´´´
#         ´´´´´´´████´´´´´´
#         ´´´´´████████´´´´
#         ´´`´███▒▒▒▒███´´´´´
#         ´´´███▒●▒▒●▒██´´´
#         ´´´███▒▒▒▒▒▒██´´´´´
#         ´´´███▒▒▒▒██´                      项目：python
#         ´´██████▒▒███´´´´´                 语言： python
#         ´██████▒▒▒▒███´´                   框架： python
#         ██████▒▒▒▒▒▒███´´´´                构建工具： python
#         ´´▓▓▓▓▓▓▓▓▓▓▓▓▓▒´´                 版本控制： git-github
#         ´´▒▒▒▒▓▓▓▓▓▓▓▓▓▒´´´´´
#         ´.▒▒▒´´▓▓▓▓▓▓▓▓▒´´´´´              代码风格：eslint-standard
#         ´.▒▒´´´´▓▓▓▓▓▓▓▒                   编辑器： pycharm
#         ..▒▒.´´´´▓▓▓▓▓▓▓▒                  数据库:  mysql
#         ´▒▒▒▒▒▒▒▒▒▒▒▒                      服务器端脚本: python
#         ´´´´´´´´´███████´´´´´              author: wzl
#         ´´´´´´´´████████´´´´´´´
#         ´´´´´´´█████████´´´´´´
#         ´´´´´´██████████´´´´             大部分人都在关注你飞的高不高，却没人在乎你飞的累不累，这就是现实！
#         ´´´´´´██████████´´´                     我从不相信梦想，我，只，相，信，自，己！
#         ´´´´´´´█████████´´
#         ´´´´´´´█████████´´´
#         ´´´´´´´´████████´´´´´
#         ________▒▒▒▒▒
#         _________▒▒▒▒
#         _________▒▒▒▒
#         ________▒▒_▒▒
#         _______▒▒__▒▒
#         _____ ▒▒___▒▒
#         _____▒▒___▒▒
#         ____▒▒____▒▒
#         ___▒▒_____▒▒
#         ███____ ▒▒
#         ████____███
#         █ _███_ _█_███
# ——————————————————————————女神保佑，代码无bug——————————————————————

#  看不懂？看不懂就对了！
class NetBugUtils:
    # 　用于并查集，集合合并
    UnionQuerySet = {}

    @staticmethod
    def Find(cls, x):
        if cls.USET.setdefault(x, x) == x:
            return x
        return cls.Find(cls.UnionQuerySet.setdefault(x, x))

    @staticmethod
    def Merge(cls, x, y):
        pX = cls.Find(x)
        pY = cls.Find(y)
        if pX == pY:
            return
        cls.UnionQuerySet[pY] = pX
